__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 2)            0                                            
__________________________________________________________________________________________________
shared_layer_1 (Dense)          (None, 10)           30          input_1[0][0]                    
__________________________________________________________________________________________________
shared_layer_2 (Dense)          (None, 10)           110         shared_layer_1[0][0]             
__________________________________________________________________________________________________
frequency_1 (Dense)             (None, 10)           110         shared_layer_2[0][0]             
__________________________________________________________________________________________________
amplitude_1 (Dense)             (None, 70)           770         shared_layer_2[0][0]             
__________________________________________________________________________________________________
decay_1 (Dense)                 (None, 60)           660         shared_layer_2[0][0]             
__________________________________________________________________________________________________
frequency_2 (Dense)             (None, 10)           110         frequency_1[0][0]                
__________________________________________________________________________________________________
amplitude_2 (Dense)             (None, 70)           4970        amplitude_1[0][0]                
__________________________________________________________________________________________________
decay_2 (Dense)                 (None, 60)           3660        decay_1[0][0]                    
__________________________________________________________________________________________________
frequency_3 (Dense)             (None, 1)            11          frequency_2[0][0]                
__________________________________________________________________________________________________
amplitude_3 (Dense)             (None, 1)            71          amplitude_2[0][0]                
__________________________________________________________________________________________________
decay_3 (Dense)                 (None, 1)            61          decay_2[0][0]                    
==================================================================================================
Total params: 10,563
Trainable params: 10,563
Non-trainable params: 0
__________________________________________________________________________________________________
